# LoadFamily Method (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..LoadFamily Method (String)
Document Class See Also
---
Loads an entire family and all its types/symbols into the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool LoadFamily(
	string filename
)
```

Visual Basic
---
```text
Public Function LoadFamily ( _
	filename As String _
) As Boolean
```

Visual C++
---
```text
public:
bool LoadFamily(
	String^ filename
)
```

# ### Parameters
filename
    Type: System..::..StringThe fully qualified filename of the Family file, usually ending in .rfa.
# ### Return Value
True if the entire family was loaded successfully into the project, otherwise False.
# Remarks
Loading an entire family may take a considerable amount of time and memory. It is recommended that you use one of the LoadFamilySymbol() methods and only load those symbols that you need.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when filename is nullNothingnullptra null reference (Nothing in Visual Basic) or empty. |

# See Also
Document Class
LoadFamily Overload
Autodesk.Revit.DB Namespace